tests/phpunit/events/charge-refunded.json

{
    "id": "evt_chargerefunded",
    "type": "charge.refunded",
    "data": {
        "object": {
            "id": "ch_1A8OQSLEJyfuWvBBCkqwVWBy",
            "object": "charge",
            "amount": 500,
            "amount_captured": 500,
            "amount_refunded": 500,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_16RQJsLEJyfuWvBBBI97Sohm",
            "billing_details": {
                "address": {
                    "city": "Ville",
                    "country": "France",
                    "line1": "4 Grande Rue",
                    "line2": null,
                    "postal_code": "26400",
                    "state": null
                },
                "email": "frank.roosevelt@example.com",
                "name": "Franklin Roosevelt",
                "phone": null
            },
            "calculated_statement_descriptor": null,
            "captured": true,
            "created": 1492153260,
            "currency": "eur",
            "customer": "cus_AQQHSNDRvT9RYr",
            "description": null,
            "disputed": false,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "invoice": "in_1A8OQSLEJyfuWvBBUE62lLhV",
            "livemode": false,
            "metadata": {},
            "on_behalf_of": null,
            "order": null,
            "outcome": {
                "network_status": "approved_by_network",
                "reason": null,
                "risk_level": "normal",
                "seller_message": "Payment complete.",
                "type": "authorized"
            },
            "paid": true,
            "payment_intent": null,
            "payment_method": "card_1A8OQOLEJyfuWvBBSrUj6AiO",
            "payment_method_details": {
                "card": {
                    "brand": "visa",
                    "checks": {
                        "address_line1_check": null,
                        "address_postal_code_check": "pass",
                        "cvc_check": "pass"
                    },
                    "country": "US",
                    "exp_month": 1,
                    "exp_year": 2018,
                    "fingerprint": "r3brmq6kZsKRLded",
                    "funding": "credit",
                    "installments": null,
                    "last4": "4242",
                    "network": "visa",
                    "three_d_secure": null,
                    "wallet": null
                },
                "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/acct_16ExxKLEJyfuWvBB/ch_1A8OQSLEJyfuWvBBCkqwVWBy/rcpt_EHWtTn6zXuEUSICV4VLipi1PkuzBWG6",
            "refunded": true,
            "refunds": {
                "object": "list",
                "data": [],
                "has_more": false,
                "url": "/v1/charges/ch_1A8OQSLEJyfuWvBBCkqwVWBy/refunds"
            },
            "review": null,
            "shipping": null,
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
        }
    }
}