tests/phpunit/events/subscription.json

{
    "id": "evt_1KVmllLEJyfuWvBBKJLGjjNS",
    "object": "event",
    "api_version": "2020-03-02",
    "created": 1645491741,
    "type": "customer.subscription.created",
    "data": {
        "object": {
            "id": "sub_1KTRzSLEJyfuWvBBWBlyZyoU",
            "object": "subscription",
            "application_fee_percent": null,
            "automatic_tax": {
                "enabled": false
            },
            "billing_cycle_anchor": 1644935210,
            "billing_thresholds": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "collection_method": "charge_automatically",
            "created": 1644935210,
            "current_period_end": 1647354410,
            "current_period_start": 1644935210,
            "customer": "cus_6ejnIamyd1dayr",
            "days_until_due": null,
            "default_payment_method": null,
            "default_source": null,
            "default_tax_rates": [],
            "discount": null,
            "ended_at": null,
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_L9lW7IgaNHZKcK",
                        "object": "subscription_item",
                        "billing_thresholds": null,
                        "created": 1644935210,
                        "metadata": {},
                        "price": {
                            "id": "price_1J6ErRLEJyfuWvBBEnN3Y6La",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1624626861,
                            "currency": "eur",
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_JjiIPD7pifRJMk",
                            "recurring": {
                                "aggregate_usage": null,
                                "interval": "month",
                                "interval_count": 1,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 100,
                            "unit_amount_decimal": "100"
                        },
                        "quantity": 1,
                        "subscription": "sub_1KTRzSLEJyfuWvBBWBlyZyoU",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "url": "/v1/subscription_items?subscription=sub_1KTRzSLEJyfuWvBBWBlyZyoU"
            },
            "latest_invoice": null,
            "livemode": false,
            "metadata": {},
            "next_pending_invoice_item_invoice": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": null,
                "payment_method_types": null
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "schedule": null,
            "start_date": 1644935210,
            "status": "active",
            "transfer_data": null,
            "trial_end": null,
            "trial_start": null
        }
    }
}